android/lib/src/main/res/raw/ws_emulator_response.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:dn="http://www.onvif.org/ver10/network/wsdl"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">
    <SOAP-ENV:Header>
        <wsa:MessageID>urn:uuid:27416298-5566-7788-99ac-30fff68b6b51</wsa:MessageID>
        <wsa:RelatesTo>urn:uuid:e064ac39-7665-4cba-bba5-2141f89f3d91</wsa:RelatesTo>
        <wsa:To SOAP-ENV:mustUnderstand="true">
            http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
        </wsa:To>
        <wsa:Action SOAP-ENV:mustUnderstand="true">
            http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches
        </wsa:Action>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <d:ProbeMatches>
            <d:ProbeMatch>
                <wsa:EndpointReference>
                    <wsa:Address>urn:uuid:49375d2c-5566-7788-99aa-30fff68b6b51</wsa:Address>
                </wsa:EndpointReference>
                <d:Types>dn:NetworkVideoTransmitter</d:Types>
                <d:Scopes>onvif://www.onvif.org/type/video_encoder
                    onvif://www.onvif.org/type/audio_encoder
                    onvif://www.onvif.org/hardware/IPC-model
                    onvif://www.onvif.org/location/country/china onvif://www.onvif.org/name/NVT
                    onvif://www.onvif.org/Profile/Streaming
                    onvif://www.onvif.org/A1C2B3/mac/30:ff:f6:8b:6b:51
                </d:Scopes>
                <d:XAddrs>http://192.168.15.5:8899/onvif/device_service</d:XAddrs>
                <d:MetadataVersion>10</d:MetadataVersion>
            </d:ProbeMatch>
        </d:ProbeMatches>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>